Tests/Langley/Beta1p1-coarse/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 292.15;

boundaryField
{
    "(inlet).*"
    {
        type             uniformFixedValue;
        uniformValue     constant 163.5;
        value            $internalField;
    }
    
    "(outlet).*"
    {
        type		zeroGradient;
    }
    
    ".*(walls).*"
    {
        type		zeroGradient;
    }
    
    #include "constr.include"
}


// ************************************************************************* //
